; domain
(define (domain SlidingTilePuzzle)
    (:requirements :typing)
    
    (:types
        tile tile_location - object ;tile is the location in the grid / v_n is the nth value i.e v_1 = 1
    )
    
    (:predicates
        (tile-at ?t - tile ?tl - tile_location) ;checks if a tile has a value
        
        (to-left ?current-tile ?left-tile - tile_location) ;denotes the tile to the left of the current tile
        (to-right ?current-tile ?right-tile - tile_location) ;denotes the tile to the right of the current tile
        (to-up ?current-tile ?up-tile - tile_location) ;denotes the tile above of the current tile
        (to-down ?current-tile ?down-tile - tile_location) ;denotes the tile below of the current tile
        
        (is-empty ?tl - tile_location) ;checks if a tile is empty
    )

    (:action SLIDE-LEFT
        :parameters (?current-tile - tile_location ?tile - tile ?left-tile - tile_location)
        :precondition (and
            (tile-at ?tile ?current-tile)
            
            (is-empty ?left-tile)
            (not (is-empty ?current-tile))
            
            (to-left ?current-tile ?left-tile)
            (to-right ?left-tile ?current-tile)
        )
        :effect (and
            (not (tile-at ?tile ?current-tile))
            (not (is-empty ?left-tile))
            (tile-at ?tile ?left-tile)
            (is-empty ?current-tile)
        )
    )
    
    (:action SLIDE-RIGHT
        :parameters (?current-tile - tile_location ?tile - tile ?right-tile - tile_location)
        :precondition (and
            (tile-at ?tile ?current-tile)
            
            (is-empty ?right-tile)
            (not (is-empty ?current-tile))
            
            (to-right ?current-tile ?right-tile)
            (to-left ?right-tile ?current-tile)
        )
        :effect (and
            (not (tile-at ?tile ?current-tile))
            (not (is-empty ?right-tile))
            (tile-at ?tile ?right-tile)
            (is-empty ?current-tile)
        )
    )
    
    (:action SLIDE-UP
        :parameters (?current-tile - tile_location ?tile - tile ?up-tile - tile_location)
        :precondition (and
            (tile-at ?tile ?current-tile)
            
            (is-empty ?up-tile)
            (not (is-empty ?current-tile))
            
            (to-up ?current-tile ?up-tile)
            (to-down ?up-tile ?current-tile)
        )
        :effect (and
            (not (tile-at ?tile ?current-tile))
            (not (is-empty ?up-tile))
            (tile-at ?tile ?up-tile)
            (is-empty ?current-tile)
        )
    )
    
    (:action SLIDE-DOWN
        :parameters (?current-tile - tile_location ?tile - tile ?down-tile - tile_location)
        :precondition (and
            (tile-at ?tile ?current-tile)
            
            (is-empty ?down-tile)
            (not (is-empty ?current-tile))
            
            (to-down ?current-tile ?down-tile)
            (to-up ?down-tile ?current-tile)
        )
        :effect (and
            (not (tile-at ?tile ?current-tile))
            (not (is-empty ?down-tile))
            (tile-at ?tile ?down-tile)
            (is-empty ?current-tile)
        )
    )
)

; problem
(define (problem Problem6)
    (:domain SlidingTilePuzzle)
    
    (:objects
        tile-loc_1 tile-loc_2 tile-loc_3 tile-loc_4 tile-loc_5 tile-loc_6 tile-loc_7 tile-loc_8 tile-loc_9 - tile_location
        t_1 t_2 t_3 t_4 t_5 t_6 t_7 t_8 - tile
    )
    
    (:init
        (tile-at t_6 tile-loc_1)
        (tile-at t_4 tile-loc_2)
        (tile-at t_7 tile-loc_3)
        (tile-at t_8 tile-loc_4)
        (tile-at t_5 tile-loc_5)
        (is-empty tile-loc_6)
        (tile-at t_3 tile-loc_7)
        (tile-at t_2 tile-loc_8)
        (tile-at t_1 tile-loc_9)
    
        (to-right tile-loc_1 tile-loc_2)
        (to-right tile-loc_2 tile-loc_3)
        (to-right tile-loc_4 tile-loc_5)
        (to-right tile-loc_5 tile-loc_6)
        (to-right tile-loc_7 tile-loc_8)
        (to-right tile-loc_8 tile-loc_9)
        
        (to-left tile-loc_3 tile-loc_2)
        (to-left tile-loc_2 tile-loc_1)
        (to-left tile-loc_6 tile-loc_5)
        (to-left tile-loc_5 tile-loc_4)
        (to-left tile-loc_9 tile-loc_8)
        (to-left tile-loc_8 tile-loc_7)
        
        (to-up tile-loc_4 tile-loc_1)
        (to-up tile-loc_5 tile-loc_2)
        (to-up tile-loc_6 tile-loc_3)
        (to-up tile-loc_7 tile-loc_4)
        (to-up tile-loc_8 tile-loc_5)
        (to-up tile-loc_9 tile-loc_6)
        
        (to-down tile-loc_1 tile-loc_4)
        (to-down tile-loc_2 tile-loc_5)
        (to-down tile-loc_3 tile-loc_6)
        (to-down tile-loc_4 tile-loc_7)
        (to-down tile-loc_5 tile-loc_8)
        (to-down tile-loc_6 tile-loc_9)
    )
    
    (:goal (and
            (tile-at t_1 tile-loc_1)
            (tile-at t_2 tile-loc_2)
            (tile-at t_3 tile-loc_3)
            (tile-at t_4 tile-loc_4)
            (tile-at t_5 tile-loc_5)
            (tile-at t_6 tile-loc_6)
            (tile-at t_7 tile-loc_7)
            (tile-at t_8 tile-loc_8)
            (is-empty tile-loc_9)
        )
    )
)

; plan
1. (slide-right tile-loc_5 t_5 tile-loc_6)
   deleted: (tile-at t_5 tile-loc_5) (is-empty tile-loc_6)
   added: (tile-at t_5 tile-loc_6) (is-empty tile-loc_5)
   goals met: 0 of 9
2. (slide-right tile-loc_4 t_8 tile-loc_5)
   deleted: (tile-at t_8 tile-loc_4) (is-empty tile-loc_5)
   added: (tile-at t_8 tile-loc_5) (is-empty tile-loc_4)
   goals met: 0 of 9
3. (slide-down tile-loc_1 t_6 tile-loc_4)
   deleted: (tile-at t_6 tile-loc_1) (is-empty tile-loc_4)
   added: (tile-at t_6 tile-loc_4) (is-empty tile-loc_1)
   goals met: 0 of 9
4. (slide-left tile-loc_2 t_4 tile-loc_1)
   deleted: (tile-at t_4 tile-loc_2) (is-empty tile-loc_1)
   added: (tile-at t_4 tile-loc_1) (is-empty tile-loc_2)
   goals met: 0 of 9
5. (slide-up tile-loc_5 t_8 tile-loc_2)
   deleted: (tile-at t_8 tile-loc_5) (is-empty tile-loc_2)
   added: (tile-at t_8 tile-loc_2) (is-empty tile-loc_5)
   goals met: 0 of 9
6. (slide-left tile-loc_6 t_5 tile-loc_5)
   deleted: (tile-at t_5 tile-loc_6) (is-empty tile-loc_5)
   added: (tile-at t_5 tile-loc_5) (is-empty tile-loc_6)
   goals met: 1 of 9
7. (slide-down tile-loc_3 t_7 tile-loc_6)
   deleted: (tile-at t_7 tile-loc_3) (is-empty tile-loc_6)
   added: (tile-at t_7 tile-loc_6) (is-empty tile-loc_3)
   goals met: 1 of 9
8. (slide-right tile-loc_2 t_8 tile-loc_3)
   deleted: (tile-at t_8 tile-loc_2) (is-empty tile-loc_3)
   added: (tile-at t_8 tile-loc_3) (is-empty tile-loc_2)
   goals met: 1 of 9
9. (slide-right tile-loc_1 t_4 tile-loc_2)
   deleted: (tile-at t_4 tile-loc_1) (is-empty tile-loc_2)
   added: (tile-at t_4 tile-loc_2) (is-empty tile-loc_1)
   goals met: 1 of 9
10. (slide-up tile-loc_4 t_6 tile-loc_1)
   deleted: (tile-at t_6 tile-loc_4) (is-empty tile-loc_1)
   added: (tile-at t_6 tile-loc_1) (is-empty tile-loc_4)
   goals met: 1 of 9
11. (slide-up tile-loc_7 t_3 tile-loc_4)
   deleted: (tile-at t_3 tile-loc_7) (is-empty tile-loc_4)
   added: (tile-at t_3 tile-loc_4) (is-empty tile-loc_7)
   goals met: 1 of 9
12. (slide-left tile-loc_8 t_2 tile-loc_7)
   deleted: (tile-at t_2 tile-loc_8) (is-empty tile-loc_7)
   added: (tile-at t_2 tile-loc_7) (is-empty tile-loc_8)
   goals met: 1 of 9
13. (slide-left tile-loc_9 t_1 tile-loc_8)
   deleted: (tile-at t_1 tile-loc_9) (is-empty tile-loc_8)
   added: (tile-at t_1 tile-loc_8) (is-empty tile-loc_9)
   goals met: 2 of 9
14. (slide-down tile-loc_6 t_7 tile-loc_9)
   deleted: (tile-at t_7 tile-loc_6) (is-empty tile-loc_9)
   added: (tile-at t_7 tile-loc_9) (is-empty tile-loc_6)
   goals met: 1 of 9
15. (slide-down tile-loc_3 t_8 tile-loc_6)
   deleted: (tile-at t_8 tile-loc_3) (is-empty tile-loc_6)
   added: (tile-at t_8 tile-loc_6) (is-empty tile-loc_3)
   goals met: 1 of 9
16. (slide-right tile-loc_2 t_4 tile-loc_3)
   deleted: (tile-at t_4 tile-loc_2) (is-empty tile-loc_3)
   added: (tile-at t_4 tile-loc_3) (is-empty tile-loc_2)
   goals met: 1 of 9
17. (slide-right tile-loc_1 t_6 tile-loc_2)
   deleted: (tile-at t_6 tile-loc_1) (is-empty tile-loc_2)
   added: (tile-at t_6 tile-loc_2) (is-empty tile-loc_1)
   goals met: 1 of 9
18. (slide-up tile-loc_4 t_3 tile-loc_1)
   deleted: (tile-at t_3 tile-loc_4) (is-empty tile-loc_1)
   added: (tile-at t_3 tile-loc_1) (is-empty tile-loc_4)
   goals met: 1 of 9
19. (slide-up tile-loc_7 t_2 tile-loc_4)
   deleted: (tile-at t_2 tile-loc_7) (is-empty tile-loc_4)
   added: (tile-at t_2 tile-loc_4) (is-empty tile-loc_7)
   goals met: 1 of 9
20. (slide-left tile-loc_8 t_1 tile-loc_7)
   deleted: (tile-at t_1 tile-loc_8) (is-empty tile-loc_7)
   added: (tile-at t_1 tile-loc_7) (is-empty tile-loc_8)
   goals met: 1 of 9
21. (slide-left tile-loc_9 t_7 tile-loc_8)
   deleted: (tile-at t_7 tile-loc_9) (is-empty tile-loc_8)
   added: (tile-at t_7 tile-loc_8) (is-empty tile-loc_9)
   goals met: 2 of 9
22. (slide-down tile-loc_6 t_8 tile-loc_9)
   deleted: (tile-at t_8 tile-loc_6) (is-empty tile-loc_9)
   added: (tile-at t_8 tile-loc_9) (is-empty tile-loc_6)
   goals met: 1 of 9
23. (slide-down tile-loc_3 t_4 tile-loc_6)
   deleted: (tile-at t_4 tile-loc_3) (is-empty tile-loc_6)
   added: (tile-at t_4 tile-loc_6) (is-empty tile-loc_3)
   goals met: 1 of 9
24. (slide-right tile-loc_2 t_6 tile-loc_3)
   deleted: (tile-at t_6 tile-loc_2) (is-empty tile-loc_3)
   added: (tile-at t_6 tile-loc_3) (is-empty tile-loc_2)
   goals met: 1 of 9
25. (slide-right tile-loc_1 t_3 tile-loc_2)
   deleted: (tile-at t_3 tile-loc_1) (is-empty tile-loc_2)
   added: (tile-at t_3 tile-loc_2) (is-empty tile-loc_1)
   goals met: 1 of 9
26. (slide-up tile-loc_4 t_2 tile-loc_1)
   deleted: (tile-at t_2 tile-loc_4) (is-empty tile-loc_1)
   added: (tile-at t_2 tile-loc_1) (is-empty tile-loc_4)
   goals met: 1 of 9
27. (slide-up tile-loc_7 t_1 tile-loc_4)
   deleted: (tile-at t_1 tile-loc_7) (is-empty tile-loc_4)
   added: (tile-at t_1 tile-loc_4) (is-empty tile-loc_7)
   goals met: 1 of 9
28. (slide-left tile-loc_8 t_7 tile-loc_7)
   deleted: (tile-at t_7 tile-loc_8) (is-empty tile-loc_7)
   added: (tile-at t_7 tile-loc_7) (is-empty tile-loc_8)
   goals met: 2 of 9
29. (slide-down tile-loc_5 t_5 tile-loc_8)
   deleted: (tile-at t_5 tile-loc_5) (is-empty tile-loc_8)
   added: (tile-at t_5 tile-loc_8) (is-empty tile-loc_5)
   goals met: 1 of 9
30. (slide-left tile-loc_6 t_4 tile-loc_5)
   deleted: (tile-at t_4 tile-loc_6) (is-empty tile-loc_5)
   added: (tile-at t_4 tile-loc_5) (is-empty tile-loc_6)
   goals met: 1 of 9
31. (slide-down tile-loc_3 t_6 tile-loc_6)
   deleted: (tile-at t_6 tile-loc_3) (is-empty tile-loc_6)
   added: (tile-at t_6 tile-loc_6) (is-empty tile-loc_3)
   goals met: 2 of 9
32. (slide-right tile-loc_2 t_3 tile-loc_3)
   deleted: (tile-at t_3 tile-loc_2) (is-empty tile-loc_3)
   added: (tile-at t_3 tile-loc_3) (is-empty tile-loc_2)
   goals met: 3 of 9
33. (slide-right tile-loc_1 t_2 tile-loc_2)
   deleted: (tile-at t_2 tile-loc_1) (is-empty tile-loc_2)
   added: (tile-at t_2 tile-loc_2) (is-empty tile-loc_1)
   goals met: 4 of 9
34. (slide-up tile-loc_4 t_1 tile-loc_1)
   deleted: (tile-at t_1 tile-loc_4) (is-empty tile-loc_1)
   added: (tile-at t_1 tile-loc_1) (is-empty tile-loc_4)
   goals met: 5 of 9
35. (slide-left tile-loc_5 t_4 tile-loc_4)
   deleted: (tile-at t_4 tile-loc_5) (is-empty tile-loc_4)
   added: (tile-at t_4 tile-loc_4) (is-empty tile-loc_5)
   goals met: 6 of 9
36. (slide-up tile-loc_8 t_5 tile-loc_5)
   deleted: (tile-at t_5 tile-loc_8) (is-empty tile-loc_5)
   added: (tile-at t_5 tile-loc_5) (is-empty tile-loc_8)
   goals met: 7 of 9
37. (slide-left tile-loc_9 t_8 tile-loc_8)
   deleted: (tile-at t_8 tile-loc_9) (is-empty tile-loc_8)
   added: (tile-at t_8 tile-loc_8) (is-empty tile-loc_9)
   goals met: 9 of 9
